In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = DataFrame({"key1": ["a", "a", "b", "b", "a"],
               "key2": ["one", "two", "one", "two", "one"],
               "data1": np.random.randn(5),
               "data2": np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
1 -0.052350  0.118824    a  two
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two
4 -0.117316 -0.315683    a  one

In [8]:
grouped = df["data1"].groupby(df["key1"])

In [9]:
grouped

In [10]:
grouped.mean()

key1
a   -0.239244
b    0.206080
Name: data1, dtype: float64

In [11]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [12]:
means

key1  key2
a     one    -0.332691
      two    -0.052350
b     one    -0.280192
      two     0.692353
Name: data1, dtype: float64

In [13]:
means.unstack()

key2       one       two
key1
a    -0.332691 -0.052350
b    -0.280192  0.692353

In [14]:
states = np.array(["Ohio", "California", "California", "Ohio", "Ohio"])

In [15]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='|S10')

In [16]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [17]:
years

array([2005, 2005, 2006, 2005, 2006])

In [19]:
df["data1"].groupby([states, years]).mean()

California  2005   -0.052350
            2006   -0.280192
Ohio        2005    0.072144
            2006   -0.117316
Name: data1, dtype: float64

In [21]:
df.groupby("key1").mean()

         data1     data2
key1
a    -0.239244  0.515450
b     0.206080  0.080202

In [22]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    one  -0.332691  0.713764
     two  -0.052350  0.118824
b    one  -0.280192  0.522030
     two   0.692353 -0.361626

In [23]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [28]:
for name, group in df.groupby("key1"):
    print name
    print group

a
      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
1 -0.052350  0.118824    a  two
4 -0.117316 -0.315683    a  one
b
      data1     data2 key1 key2
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two

In [29]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
    print (k1, k2)
    print group

('a', 'one')
      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
4 -0.117316 -0.315683    a  one
('a', 'two')
     data1     data2 key1 key2
1 -0.05235  0.118824    a  two
('b', 'one')
      data1    data2 key1 key2
2 -0.280192  0.52203    b  one
('b', 'two')
      data1     data2 key1 key2
3  0.692353 -0.361626    b  two

In [34]:
pieces = dict(list(df.groupby("key1")))

In [35]:
pieces["b"]

      data1     data2 key1 key2
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two

In [36]:
df

      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
1 -0.052350  0.118824    a  two
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two
4 -0.117316 -0.315683    a  one

In [37]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [41]:
dict(list(df.groupby(df.dtypes, axis=1)))

{dtype('float64'):       data1     data2
 0 -0.548066  1.743210
 1 -0.052350  0.118824
 2 -0.280192  0.522030
 3  0.692353 -0.361626
 4 -0.117316 -0.315683, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [42]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    one   0.713764
     two   0.118824
b    one   0.522030
     two  -0.361626

In [43]:
s_grouped = df.groupby(["key1", "key2"])["data2"]

In [44]:
s_grouped

In [45]:
s_grouped.mean()

key1  key2
a     one     0.713764
      two     0.118824
b     one     0.522030
      two    -0.361626
Name: data2, dtype: float64

In [46]:
people = DataFrame(np.random.randn(5, 5), columns=["a", "b", "c", "d", "e"],
                  index=["Joe", "Steve", "Wes", "Jim", "Travis"])

In [47]:
people

               a         b         c         d         e
Joe    -0.526503  1.063397  1.405053 -0.525935 -2.053889
Steve  -0.010383 -0.877384  0.296851  0.260281  1.243329
Wes    -0.518106  0.099703 -0.457583 -0.674423 -0.287486
Jim     0.033859 -0.300428  0.703726 -0.484811 -0.294676
Travis -0.617590 -0.316589 -0.573111  0.653861 -2.080803

In [48]:
people.ix[2:3, ["b", "c"]] = np.nan

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [49]:
people

               a         b         c         d         e
Joe    -0.526503  1.063397  1.405053 -0.525935 -2.053889
Steve  -0.010383 -0.877384  0.296851  0.260281  1.243329
Wes    -0.518106       NaN       NaN -0.674423 -0.287486
Jim     0.033859 -0.300428  0.703726 -0.484811 -0.294676
Travis -0.617590 -0.316589 -0.573111  0.653861 -2.080803

In [50]:
mapping = {"a": "red", "b": "red", "c": "blue",
          "d": "blue", "e": "red", "f": "orange"}

In [51]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [52]:
by_column = people.groupby(mapping, axis=1)

In [53]:
by_column

In [54]:
by_column.sum()

            blue       red
Joe     0.879118 -1.516995
Steve   0.557132  0.355562
Wes    -0.674423 -0.805591
Jim     0.218915 -0.561245
Travis  0.080750 -3.014982

In [55]:
map_series = Series(mapping)

In [56]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [57]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [58]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.010750  0.762969  2.108779 -1.685170 -2.636050
5 -0.010383 -0.877384  0.296851  0.260281  1.243329
6 -0.617590 -0.316589 -0.573111  0.653861 -2.080803

In [59]:
key_list = ["one", "one", "one", "two", "two"]

In [60]:
key_list

['one', 'one', 'one', 'two', 'two']

In [61]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.526503  1.063397  1.405053 -0.674423 -2.053889
  two  0.033859 -0.300428  0.703726 -0.484811 -0.294676
5 one -0.010383 -0.877384  0.296851  0.260281  1.243329
6 two -0.617590 -0.316589 -0.573111  0.653861 -2.080803

In [62]:
df

      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
1 -0.052350  0.118824    a  two
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two
4 -0.117316 -0.315683    a  one

In [63]:
grouped = df.groupby("key1")

In [64]:
grouped

In [66]:
grouped["data1"].quantile(0.9)

key1
a   -0.065343
b    0.595098
Name: data1, dtype: float64

In [67]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [68]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.495715  2.058893
b     0.972545  0.883656

In [69]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.239244  0.269413 -0.548066 -0.332691 -0.117316 -0.084833
b      2.0  0.206080  0.687693 -0.280192 -0.037056  0.206080  0.449217

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.052350   3.0  0.515450  1.085240 -0.315683 -0.098430  0.118824
b     0.692353   2.0  0.080202  0.624839 -0.361626 -0.140712  0.080202


           75%      max
key1
a     0.931017  1.74321
b     0.301116  0.52203

In [70]:
df

      data1     data2 key1 key2
0 -0.548066  1.743210    a  one
1 -0.052350  0.118824    a  two
2 -0.280192  0.522030    b  one
3  0.692353 -0.361626    b  two
4 -0.117316 -0.315683    a  one

In [73]:
k1_means = df.groupby("key1").mean().add_prefix("mean_")

In [74]:
k1_means

      mean_data1  mean_data2
key1
a      -0.239244    0.515450
b       0.206080    0.080202

In [75]:
pd.merge(df, k1_means, left_on="key1", right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0 -0.548066  1.743210    a  one   -0.239244    0.515450
1 -0.052350  0.118824    a  two   -0.239244    0.515450
4 -0.117316 -0.315683    a  one   -0.239244    0.515450
2 -0.280192  0.522030    b  one    0.206080    0.080202
3  0.692353 -0.361626    b  two    0.206080    0.080202

In [76]:
key = ["one", "two", "one", "two", "one"]

In [77]:
people.groupby(key).mean()

            a         b         c         d         e
one -0.554066  0.373404  0.415971 -0.182166 -1.474059
two  0.011738 -0.588906  0.500289 -0.112265  0.474327

In [78]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.554066  0.373404  0.415971 -0.182166 -1.474059
Steve   0.011738 -0.588906  0.500289 -0.112265  0.474327
Wes    -0.554066  0.373404  0.415971 -0.182166 -1.474059
Jim     0.011738 -0.588906  0.500289 -0.112265  0.474327
Travis -0.554066  0.373404  0.415971 -0.182166 -1.474059

In [79]:
frame = DataFrame({"data1": np.random.randn(1000),
                  "data2": np.random.randn(1000)})

In [80]:
frame

        data1     data2
0    0.474881 -0.535775
1    1.984739  0.191764
2   -0.783078 -0.141492
3   -1.802724 -1.723913
4    0.518183  0.250856
5    0.836827 -0.224035
6    1.161729 -0.583041
7   -0.222785  0.476577
8   -0.300673 -0.876951
9   -2.521821  0.164265
10   0.959612 -1.647518
11  -0.843544 -1.335219
12  -1.366871  0.408330
13  -1.021017  0.560974
14   0.173940  0.308320
15   0.083784 -0.229775
16   0.527619 -0.972362
17   1.268426 -1.114109
18  -0.557496 -1.732850
19  -0.610746 -0.378813
20   1.470301  0.085780
21   0.560949 -0.091234
22   1.835079 -0.406177
23  -0.010141 -0.572782
24   1.290558 -0.135974
25  -0.888862  0.562250
26   0.195995 -0.923070
27   0.381025  1.835788
28  -1.257754  0.549517
29   1.232725  1.135113
..        ...       ...
970 -1.150208  0.118715
971 -0.445022 -0.206648
972  0.714342 -0.330662
973  1.625338 -0.268426
974  0.325770  0.029220
975 -0.855430 -0.327202
976  0.073901 -1.118208
977 -1.252826  0.056811
978 -0.634885 -1.690178
979 -2.435361 -0.467698
980  0.103374 -0.204188
981  1.118383  0.117905
982 -1.471302  1.670385
983 -0.549401 -1.570936
984 -0.344392 -0.491700
985 -0.425166  1.800052
986  0.684220  0.190343
987 -0.293761  0.163193
988 -0.157478  0.408319
989  0.949430 -0.276489
990  0.281945  1.932925
991  0.281996 -0.777971
992  1.013813  0.332643
993 -1.171675 -1.771535
994 -1.856217  0.960716
995  0.368082  0.753963
996 -1.171750  0.398002
997 -0.823923 -0.973079
998  0.073739  0.724315
999 -0.206789 -1.222575

[1000 rows x 2 columns]

In [81]:
factor = pd.cut(frame.data1, 4)

In [82]:
factor[:10]

0     (-0.125, 1.424]
1      (1.424, 2.973]
2    (-1.675, -0.125]
3     (-3.23, -1.675]
4     (-0.125, 1.424]
5     (-0.125, 1.424]
6     (-0.125, 1.424]
7    (-1.675, -0.125]
8    (-1.675, -0.125]
9     (-3.23, -1.675]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.23, -1.675] < (-1.675, -0.125] < (-0.125, 1.424] < (1.424, 2.973]]

In [83]:
def get_stats(group):
    return {"min": group.min(), "max": group.max(),
           "count": group.count(), "mean": group.mean()}

In [84]:
grouped = frame.data2.groupby(factor)

In [86]:
grouped.apply(get_stats)

data1
(-3.23, -1.675]   count     47.000000
                  max        1.781481
                  mean      -0.043910
                  min       -2.164888
(-1.675, -0.125]  count    427.000000
                  max        3.111475
                  mean      -0.004236
                  min       -3.436508
(-0.125, 1.424]   count    457.000000
                  max        2.442543
                  mean      -0.059806
                  min       -3.115034
(1.424, 2.973]    count     69.000000
                  max        2.606685
                  mean       0.187140
                  min       -1.462774
Name: data2, dtype: float64

In [87]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.23, -1.675]    47.0  1.781481 -0.043910 -2.164888
(-1.675, -0.125]  427.0  3.111475 -0.004236 -3.436508
(-0.125, 1.424]   457.0  2.442543 -0.059806 -3.115034
(1.424, 2.973]     69.0  2.606685  0.187140 -1.462774

In [91]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [92]:
grouped = frame.data2.groupby(grouping)

In [93]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.328206  0.072963 -2.309659
1      100.0  2.040058 -0.144954 -2.022206
2      100.0  3.111475  0.048919 -2.882884
3      100.0  2.643595  0.031035 -2.647146
4      100.0  2.435828 -0.080704 -3.436508
5      100.0  2.442543 -0.050477 -2.062396
6      100.0  2.273052 -0.133649 -2.747318
7      100.0  2.377427 -0.035343 -2.568589
8      100.0  1.963802  0.006940 -3.115034
9      100.0  2.606685  0.102360 -1.462774

In [94]:
s = Series(np.random.randn(6))

In [95]:
s

0    1.499308
1    1.078413
2   -0.979985
3    0.456747
4   -0.431616
5   -0.148281
dtype: float64

In [97]:
s[::2] = np.nan

In [98]:
s

0         NaN
1    1.078413
2         NaN
3    0.456747
4         NaN
5   -0.148281
dtype: float64

In [99]:
s.fillna(s.mean())

0    0.462293
1    1.078413
2    0.462293
3    0.456747
4    0.462293
5   -0.148281
dtype: float64

In [100]:
states = ["Ohio", "New York", "Vermont", "Florida",
         "Oregon", "Nevada", "California", "Idaho"]

In [101]:
states

['Ohio',
 'New York',
 'Vermont',
 'Florida',
 'Oregon',
 'Nevada',
 'California',
 'Idaho']

In [102]:
group_key = ["East"] * 4 + ["West"] * 4

In [103]:
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [106]:
data = Series(np.random.randn(8), index=states)

In [107]:
data

Ohio         -1.134284
New York     -0.025793
Vermont      -0.072275
Florida       0.982073
Oregon       -0.770529
Nevada       -0.154711
California   -0.212987
Idaho        -0.299317
dtype: float64

In [108]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [109]:
data

Ohio         -1.134284
New York     -0.025793
Vermont            NaN
Florida       0.982073
Oregon       -0.770529
Nevada             NaN
California   -0.212987
Idaho              NaN
dtype: float64

In [110]:
data.groupby(group_key).mean()

East   -0.059335
West   -0.491758
dtype: float64

In [111]:
fill_mean = lambda g: g.fillna(g.mean())

In [112]:
data.groupby(group_key).apply(fill_mean)

Ohio         -1.134284
New York     -0.025793
Vermont      -0.059335
Florida       0.982073
Oregon       -0.770529
Nevada       -0.491758
California   -0.212987
Idaho        -0.491758
dtype: float64

In [113]:
fill_values = {"East": 0.5, "West": -1}

In [114]:
fill_values

{'East': 0.5, 'West': -1}

In [115]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [117]:
suits = ["H", "S", "C", "D"]

In [118]:
suits

['H', 'S', 'C', 'D']

In [123]:
card_val = (range(1, 11) + [10] * 3) * 4

In [124]:
card_val

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10]

In [125]:
base_names = ["A"] + range(2, 11) + ["J", "K", "Q"]

In [126]:
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [131]:
cards = []

In [132]:
for suit in ["H", "S", "C", "D"]:
    cards.extend(str(num) + suit for num in base_names)

In [133]:
cards

['AH',
 '2H',
 '3H',
 '4H',
 '5H',
 '6H',
 '7H',
 '8H',
 '9H',
 '10H',
 'JH',
 'KH',
 'QH',
 'AS',
 '2S',
 '3S',
 '4S',
 '5S',
 '6S',
 '7S',
 '8S',
 '9S',
 '10S',
 'JS',
 'KS',
 'QS',
 'AC',
 '2C',
 '3C',
 '4C',
 '5C',
 '6C',
 '7C',
 '8C',
 '9C',
 '10C',
 'JC',
 'KC',
 'QC',
 'AD',
 '2D',
 '3D',
 '4D',
 '5D',
 '6D',
 '7D',
 '8D',
 '9D',
 '10D',
 'JD',
 'KD',
 'QD']

In [134]:
deck = Series(card_val, index = cards)

In [135]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [136]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])

In [137]:
draw(deck)

4H     4
3C     3
KD    10
2D     2
6C     6
dtype: int64

In [138]:
get_suit = lambda card: card[-1]

In [139]:
deck.groupby(get_suit).apply(draw, n=2)

C  6C     6
   QC    10
D  5D     5
   6D     6
H  JH    10
   AH     1
S  KS    10
   5S     5
dtype: int64

In [140]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

6C     6
2C     2
7D     7
2D     2
KH    10
9H     9
JS    10
QS    10
dtype: int64

In [141]:
df = DataFrame({"category": ["a", "a", "a", "a", "b", "b", "b", "b"],
               "data": np.random.randn(8),
               "weights": np.random.randn(8)})

In [142]:
df

  category      data   weights
0        a -1.767601  0.294890
1        a  0.252464 -0.208160
2        a  1.074137 -0.177314
3        a  1.605658 -0.022677
4        b -0.370018 -0.350853
5        b -0.759341 -0.245071
6        b  0.173523  0.321732
7        b  0.653849  0.641751

In [143]:
grouped = df.groupby("category")

In [144]:
get_wavg = lambda g: np.average(g["data"], weights=g["weights"])

In [145]:
grouped.apply(get_wavg)

category
a    7.069239
b    2.152986
dtype: float64